// 0. Используя оператор prompt, запросите у пользователя ввод числа.
// В ответ сообщите является ли число четным или нечетным.

// 1. Загадайте загадку и сохраните ответ в переменной rightAnswer
// Используя оператор prompt, задайте загадку пользователю и сохраните ответ
// Проверьте ответ на правильность и выведите сообщения "Правильно" или "Неправильно" по ситуации
// Для проверки используйте конструкцию if..else

// 2. Перепишите предыдущее упражнение, используя тернарный оператор

// 3. Перепишите предыдущее упражнение, используя оператор switch

// 4. Используя оператор prompt, запросите у пользователя ввод любых значений
// В ответ сообщите пользователю, какой тип данных он использовал
// (Подсказка: prompt всегда возвращает строку, поэтому нужны проверки с преобразованием типов)

// 5. Создайте два случайных числа в диапазоне от 1 до 10 (сохраните в переменные x, y).
// Выведите их в консоль, а также сообщение о том какое значение больше.
