// Создайте функцию с рекурсией printFiveTimes, которая принимает символ и печатает его пять раз.

// Создайте функцию с рекурсией getArrLenght, которая принимает массив и возвращает количество его элементов без использования свойства length.

// Создайте функцию с рекурсией sumOfDigits, которая принимает число и возвращает сумму всех целых чисел от 1 до текущего числа
// Пример: console.log(sumOfDigits(3)); // 1+2+3 = 6

// Напишите функцию flow, которая принимает входное значение и массив функций. Функции должны последовательно выполняться - сначала первая с полученным аргументом, ее  результат выполнения - входной параметр для второй функции и так далее
