/* Условия */
// 1. Используя конструкцию if..else, напишите код, который получает число через prompt, а затем выводит в alert:
//   1, если значение больше нуля,
//   -1, если значение меньше нуля,
//   0, если значение равно нулю.
// Предполагается, что пользователь вводит только числа.

// 2. Перепишите if-конструкцию с использованием условного оператора '?':
// const a = 1;
// const b = 2;
// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }

// 2.1 Использование метода str.includes(). Задать загадку через alert, проверить введенный ответ на вхождение правильного ответа (предварительно переведя ответ в нижний регистр). В зависимости от правильного ответа, выдать alert'ом - правильно или нет.

// 3. Перепишите код ниже с использованием одной конструкции switch:
// const number = +prompt('Введите число между 0 и 3', '');

// if (number === 0) {
//   alert('Вы ввели число 0');
// }

// if (number === 1) {
//   alert('Вы ввели число 1');
// }

// if (number === 2 || number === 3) {
//   alert('Вы ввели число 2, а может и 3');
// }

/* Циклы */
// 1. При помощи цикла while выведите чётные числа от 2 до 10. (либо до запрошеного у пользователя числа)

// 2. Напишите цикл, который предлагает prompt ввести число, большее 100. Если посетитель ввёл другое число – попросить ввести ещё раз, и так далее.

// 3. Выведите квадраты всех чисел от 1 до 20 в цикле for

// 4. Выведите в консоли "ёлку":
// *
// **
// ***
// ****
// *****
// ******

// 5. Создайте бесконечный цикл с проверкой правильности ввода числа пользователем. Подсчитать кол-во некорректных вводов пользователем.

// 6. Запросить у пользователя строку и вывести ее в консоль побуквенно на разных строчках, исключая пробелы.
