// 1. Создайте функцию addY, которая принимает строку и возвращает новую строку с добавлением буквы "ы" на конце

// 2. Напишите функцию, которая находит кол-во цифр в числе (Примечание: без преобразования в строку).

// 3. Напишите функцию, которая принимает четыре числа и возвращает их среднее арифметическое. Используйте значения по умолчанию, чтобы функцию можно было вызвать с меньшим количеством аргументов.

// 4. Создайте функцию addByX, которая принимает числовое значение (x) и возвращает новую функцию. Новая функция принимает число и возвращает его сумму с ранее полученным x.
// В результате создания функции addByX, должны работать следующие реализации
// const addByTwo = addByX(2);
// addByTwo(1); // должен вернуть 3
// addByTwo(2); // должен вернуть 4
// addByTwo(3); // должен вернуть 5

// const addByThree = addByX(3);
// addByThree(1); // должен вернуть 4
// addByThree(2); // должен вернуть 5

// const addByFour = addByX(4);
// addByFour(4); //должен вернуть 8
// addByFour(10); //должен вернуть 14
