// 1. Напишите функцию addTen, которая принимает число, прибавляет к нему 10 и возвращает полученный результат

// 2. Напишите функцию isOdd, которая принимает число и проверяет его на чет/нечет (возвращеает true для нечетного числа, false для четного)

// 3. Напишите функцию getSquare для нахождения площади прямоугольника со сторонами width и height

// 4. Напишите функцию kmToMiles, которая принимает значение в километрах, а возвращает преобразованное значение в милях

// 5. Напишите функцию sayHello, которая принимает имя и возврщает приветствие с этим именем. Например, "Пример, Мэри!"

// 6. Напишите функцию sign, которая принимает аргумент t и возвращает 1, если число t - положительное, и -1, если t - отрицательное. В противном случае - 0

// 7. Написать функцию rand(), которая возвращает случайное целое число в указанном диапазоне

// 8. Напишите функцию, которая находит кол-во цифр в числе.
