// 1. Создайте функцию multiply, которая принимает два числа, перемножает их и возвращает результат
// для каждого параметра задайте значение по умолчанию 1

// 2. Напишите функцию createGreeting, которая возвращает новую функцию, результатом вызова которой будет вывод в консоль сообщения "Hello from closure"

// 3. Напишите функцию createFunction, которая принимает строку и возвращает новую функцию, результат вызова которой является вывод в консоль полученной ранее строки.

// 4. Напишите функцию createCountdown, которая принимает число и возвращает новую функцию. При вызове новой функции каждый раз отнимается 1 от изначально полученного числа и результат печатается в консоль.
