// 1. Создать базовый класс Goods со свойствами title, price;
//  методом show() - показывающим св-ва объекта
//  Создать 2 экземпляра класса Goods (new Goods(...)), проверить работу метода show. Посмотреть в консоли цепочку наследования.

// 2. Создать класс наследник Phone со свойством type (возможные значения "smartphone", "homephone", "simple mobile") и методом ring (выводит в консоль "hello phone")
// Создать 2 экземпляра класса Phone, проверить работу методов. Посмотреть в консоли цепочку наследования. Используя оператор instanceof проверить являются экземпляры потомками классов Phone и Goods.
