// 1. Создайте функцию createPhone, которая принимает название модели телефона и его стоимость и возвращает новый объект с полями name и price, куда записываются полученные данные. Создайте несколько объектов, вызывая функцию createPhone.

// 2. Создайте функцию-конструктор CreatePhone, которая принимает название модели телефона и его стоимость и возвращает новый объект с полями name и price, куда записываются полученные данные. Создайте несколько объектов, используя конструктор CreatePhone.

// 3. Добавьте в прототип CreatePhone метод ring (который печатает в консоль сообщение с названием модели). Создайте несколько объектов через CreatePhone. Вызовите у них метод ring. Посмотрите в консоли какие ключи есть у созданных объектов.

// 4. Для созданных объектов из метода 4 воспользуйтесь методом hasOwnProperty, чтобы проверить является ли метод ring их собственным свойством. Затем используйте оператор in, чтобы проверить есть ли данное свойство у объектов.
