// 1. Создайте объект с двумя простыми свойствами и функциональным свойством (методом), выводящим эти свойства. Вызовите метод объекта.

// 2. Напишите код, выполнив задание из каждого пункта отдельной строкой:
// Создайте пустой объект user.
// Добавьте свойство name со значением Vasya.
// Добавьте свойство surname со значением Petrov.
// Измените значение свойства name на Ivan.
// Удалите свойство name из объекта.

// 3. Создайте объект с информацией о стоимости покупки (ключ - название продукта, значение - его цена). Создайте функцию, которая подсчитывает сумму всех покупок.

// 4. Скопируйте объект из предыдущего задания (без ссылки). Измените стоимость одного из его товаров. Проверьте, чтобы изменения не повлияли на исходный объект.

// 5. Создайте функцию hasNameProp, которая принимает объект и проверяет есть ли у него свойство 'name'. Возвращает true - когда свойство есть, false - когда свойства нет. Создайте несколько объектов с наличием ключа name и без него, проверьте корректность работы функции

// 6. Создайте функцию hasProp, которая принимает на вход объект и строку. Функция возварает true - когда в объекте есть свойство по имени переданной строки, false - в противном случае.
// Пример:
// const myObj = {name: 'Mikhail', location: 'Moscow'}
// console.log(hasProp(myObj, 'location')); // должен вывести true
